init.org
# Tangle by default to config.el, which is the most common case
#+property: header-args:emacs-lisp :tangle init.el
#+property: header-args :mkdirp yes :comments no
#+startup: fold

* Bootstrap
#+begin_src emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Install use-package
(straight-use-package 'use-package)

;; Configure use-package to use straight.el by default
(use-package straight
  :custom (straight-use-package-by-default t))

(require 'use-package-ensure)
(setq use-package-always-ensure t)
#+end_src

#+begin_src emacs-lisp
(use-package general
  :config (general-evil-setup t))
#+end_src

* Default keybinds
** Toggle fullscreen
#+begin_src emacs-lisp
(nmap "C-s-f" 'toggle-frame-fullscreen)
#+end_src
** Kill buffer
#+begin_src emacs-lisp
(nmap "ZX" 'kill-current-buffer)
#+end_src
** Right option
#+begin_src emacs-lisp
(setq ns-right-option-modifier nil)
#+end_src
* Interface
** Font settings
#+begin_src emacs-lisp
(custom-set-faces
 `(default ((t (:font "JetBrains Mono 16"))))
 `(fixed-pitch ((t (:inherit (default)))))
 `(fixed-pitch-serif ((t (:inherit (default)))))
 `(variable-pitch ((t (:font "JetBrains Mono 16")))))
#+end_src

** Theme settings
#+begin_src emacs-lisp
(use-package doom-themes
  :config (load-theme 'doom-palenight t))
#+end_src

** Line numbers
#+begin_src emacs-lisp
(add-hook 'prog-mode-hook (lambda ()
                            (display-line-numbers-mode)
                            (setq display-line-numbers 'relative)))
(add-hook 'text-mode-hook (lambda ()
                            (display-line-numbers-mode)
                            (setq display-line-numbers 'relative)))
#+end_src

** Ring bell
#+begin_src emacs-lisp
(setq ring-bell-function 'ignore)
#+end_src
** Highlight current line
#+begin_src emacs-lisp
(global-hl-line-mode +1)
#+end_src
** Scrolling
#+begin_src emacs-lisp
(setq scroll-margin 10
      hscroll-margin 20
      fast-but-imprecise-scrolling t
      scroll-conservatively 101
      scroll-preserve-screen-position t)
#+end_src
** Yes-or-no
#+begin_src emacs-lisp
(setq use-short-answers t)
(advice-add 'yes-or-no-p :override #'y-or-n-p)
#+end_src
** Word wrap
#+begin_src emacs-lisp
(use-package adaptive-wrap
  :config
  (global-visual-line-mode t)
  (add-hook 'visual-line-mode-hook
            (lambda () (unless (equal major-mode 'org-mode)
                         (adaptive-wrap-prefix-mode)))))
#+end_src
** Disable default interface
#+begin_src emacs-lisp
(tooltip-mode      -1)
(menu-bar-mode     -1)
(tool-bar-mode     -1)
(scroll-bar-mode   -1)
(blink-cursor-mode -1)
(setq use-dialog-box nil
      redisplay-dont-pause t
      inhibit-startup-screen t)
#+end_src
** Modeline
#+begin_src emacs-lisp
(use-package nano-modeline
  :custom
  (nano-modeline-position 'bottom)
  :init (nano-modeline-mode 1))
#+end_src
** Todo highlights
#+begin_src emacs-lisp
(use-package hl-todo
  :config
  (global-hl-todo-mode)

  (setq hl-todo-highlight-punctuation ":"
        hl-todo-keyword-faces
        '(("TODO" warning bold)
          ("FIXME" error bold)
          ("REVIEW" font-lock-keyword-face bold)
          ("HACK" font-lock-constant-face bold)
          ("DEPRECATED" font-lock-doc-face bold)
          ("NOTE" success bold)
          ("BUG" error bold)
          ("XXX" font-lock-constant-face bold))))
#+end_src
** Show tabs
#+begin_src emacs-lisp
(global-whitespace-mode +1)
(setq whitespace-style '(face tabs))
#+end_src
** Splitting
#+begin_src emacs-lisp
(setq split-width-threshold t)
#+end_src
* Editing
** Electric
#+begin_src emacs-lisp
(electric-pair-mode +1)
(electric-indent-mode +1)
#+end_src

** Snippets
#+begin_src emacs-lisp
(use-package yasnippet
  :config
  (yas-global-mode +1)

  (setq yas-indent-line 'fixed)
  (setq yas-triggers-in-field t)
  (setq yas-key-syntaxes '("w_.()" "w_." "w_" "w" "w\\"))
  (add-to-list 'warning-suppress-types '(yasnippet backquote-change))
  
  (imap
    :keymaps 'org-mode-map
    "C-<tab>" 'yas-expand))
#+end_src

** Tabs
#+begin_src emacs-lisp
(setq-default tab-width 4)
#+end_src
* Movement
** Avy
#+begin_src emacs-lisp
(use-package avy
  :config
  (setq avy-timeout-seconds 0.75)
  (nmap "s" 'avy-goto-char-timer))
#+end_src
* Completion
** LSP
#+begin_src emacs-lisp
(use-package eglot
  :ensure t)
#+end_src
** Vertico
#+begin_src emacs-lisp
(use-package vertico
  :general
  (:keymaps 'vertico-map
            "C-j" 'vertico-next
            "C-k" 'vertico-previous)
  :init
  (recentf-mode +1)
  (vertico-mode +1)
  
  (setq vertico-count 10
        vertico-resize nil
        vertico-cycle t)

  (setq completion-in-region-function
        (lambda (&rest args)
          (apply (if vertico-mode
                     #'consult-completion-in-region
                   #'completion--in-region)
                 args))))
#+end_src
** Consult
#+begin_src emacs-lisp
(use-package consult
  :custom
  (consult-preview-key nil)
  :config
  (nmap
    :prefix "SPC f"
    :keymaps 'override
    "r" 'consult-recent-file
    "f" 'consult-find
    "g" 'consult-ripgrep))
#+end_src
** Marginalia
#+begin_src emacs-lisp
(use-package marginalia
  :init (marginalia-mode))
#+end_src
** Orderless
#+begin_src emacs-lisp
(use-package orderless
  :custom
  (completion-styles '(orderless basic))
  (completion-category-overrides '((file (styles basic partial-completion)))))
#+end_src
** Corfu
#+begin_src emacs-lisp
(use-package corfu
  ;; Optional customizations
  :custom
  (corfu-cycle t)
  (corfu-auto t)
  (corfu-scroll-margin 5)
  (corfu-auto-delay 0.75)
  (corfu-count 5)
  (corfu-auto-prefix 2)

  :general
  (imap "C-n" 'completion-at-point)

  :hook ((prog-mode . corfu-mode)
         (shell-mode . corfu-mode)
         (eshell-mode . corfu-mode))

  :init
  (global-corfu-mode))
#+end_src
* History
#+begin_src emacs-lisp
(use-package savehist
  :init
  (savehist-mode))
#+end_src
* Evil
** Evil mode
#+begin_src emacs-lisp
(use-package evil
  :init
  (setq evil-want-keybinding nil
        evil-want-Y-yank-to-eol t
        evil-want-C-u-scroll t
        evil-undo-system 'undo-fu
        evil-split-window-below t
        evil-vsplit-window-right t)
  :config
  (evil-mode)
  (general-unbind 'evil-motion-state-map "TAB")
  (general-unbind 'pdf-view-mode-map "SPC")

  
  (evil-define-motion evil-next-line (count)
    :type exclusive
    (if count
        (let (line-move-visual) (evil-line-move count))
      (let ((line-move-visual t)) (evil-line-move 1))))

  (evil-define-motion evil-previous-line (count)
    :type exclusive
    (if count
        (let (line-move-visual) (evil-line-move (- count)))
      (let ((line-move-visual t)) (evil-line-move -1))))

  (evil-select-search-module 'evil-search-module 'evil-search))
#+end_src
** Evil collection
#+begin_src emacs-lisp
(use-package evil-collection
  :after evil
  :config (evil-collection-init))
#+end_src
** Evil highlights
#+begin_src emacs-lisp
(use-package evil-goggles
  :custom
  (evil-goggles-enable-paste nil)
  (evil-goggles-enable-change nil)
  (evil-goggles-enable-delete nil)
  :config
  (evil-goggles-mode))
#+end_src
** Evil commentary
#+begin_src emacs-lisp
(use-package evil-commentary
  :init (evil-commentary-mode))
#+end_src
* Git
** Magit
#+begin_src emacs-lisp
(use-package magit
  :config
  (setq magit-display-buffer-function #'magit-display-buffer-fullframe-status-v1)
  (nmap
    :prefix "SPC g"
    "g" 'magit))
#+end_src
** Git gutter
#+begin_src emacs-lisp
(use-package git-gutter
  :custom
  (git-gutter:modified-sign "│")
  (git-gutter:added-sign "│")
  (git-gutter:deleted-sign "│")
  :init (global-git-gutter-mode +1))
#+end_src
* Tools
** Flycheck
#+begin_src emacs-lisp
(use-package flycheck
  :init (global-flycheck-mode))
#+end_src
** Autosave
#+begin_src emacs-lisp
(setq make-backup-files nil)
(setq auto-save-default nil)
#+end_src
** Formatting
#+begin_src emacs-lisp
(use-package apheleia
  :config
  (apheleia-global-mode +1))
#+end_src
** Spelling
*** Enable spelling
#+begin_src emacs-lisp
(add-hook 'text-mode-hook 'flyspell-mode)
(add-hook 'prog-mode-hook 'flyspell-prog-mode)

(with-eval-after-load 'ispell
  (setenv "LANG" "en_US, ru_RU")
  (setq ispell-really-hunspell t
        ispell-program-name "hunspell"
        ispell-dictionary "en_US,ru_RU")
  ;; ispell-set-spellchecker-params has to be called
  ;; before ispell-hunspell-add-multi-dic will work
  (ispell-set-spellchecker-params)
  (ispell-hunspell-add-multi-dic "en_US,ru_RU"))
#+end_src
*** Flyspell correct
#+begin_src emacs-lisp
(use-package flyspell-correct
  :after flyspell
  :general
  (nmap :keymaps 'flyspell-mode-map
    "z=" 'flyspell-correct-wrapper))

(use-package flyspell-correct-avy-menu
  :after flyspell-correct
  :config (require 'flyspell-correct-avy-menu))
#+end_src
*** Add word
#+begin_src emacs-lisp
(defun ispell-add-word (word &optional scope)
  "Add WORD to your personal dictionary, within SCOPE.
SCOPE can be `buffer' or `session' to exclude words only from the current buffer
or session. Otherwise, the addition is permanent."
  (interactive
   (list (progn (require 'flyspell)
                (car (flyspell-get-word)))
         (cond ((equal current-prefix-arg '(16))
                'session)
               ((equal current-prefix-arg '(4))
                'buffer))))
  (require 'flyspell)
  (cond
   ((null scope)
    (ispell-send-string (concat "*" word "\n"))
    (ispell-send-string "#\n")
    (flyspell-unhighlight-at (point))
    (setq ispell-pdict-modified-p '(t)))
   ((memq scope '(buffer session))
    (ispell-send-string (concat "@" word "\n"))
    (add-to-list 'ispell-buffer-session-localwords word)
    (or ispell-buffer-local-name ; session localwords might conflict
        (setq ispell-buffer-local-name (buffer-name)))
    (flyspell-unhighlight-at (point))
    (if (null ispell-pdict-modified-p)
        (setq ispell-pdict-modified-p
              (list ispell-pdict-modified-p)))
    (if (eq scope 'buffer)
        (ispell-add-per-file-word-list word))))
  (ispell-pdict-save t))

(nmap "zg" 'ispell-add-word)
#+end_src
** PDF Viewer
#+begin_src emacs-lisp
(use-package pdf-tools
  :custom (pdf-view-display-size 'fit-height)
  :config
  (add-hook 'doc-view-mode-hook 'pdf-view-mode)
  (add-hook 'pdf-view-mode-hook 'pdf-isearch-minor-mode))
#+end_src
** Undo 
#+begin_src emacs-lisp
(use-package undo-fu)

(use-package undo-fu-session
  :after undo-fu
  :init (global-undo-fu-session-mode))
#+end_src
** Terminal
#+begin_src emacs-lisp
(use-package vterm
  :ensure t)

(use-package vterm-toggle
  :general
  (nmap
    :prefix "SPC o"
    :keymaps 'override
    "t" 'vterm-toggle
    "T" 'vterm-toggle-cd)
  (nmap
    :keymaps 'vterm-mode-map
    "q" 'vterm-toggle-hide)
  :config
  (add-to-list 'display-buffer-alist
               '((lambda (buffer-or-name _)
                   (let ((buffer (get-buffer buffer-or-name)))
                     (with-current-buffer buffer
                       (or (equal major-mode 'vterm-mode)
                           (string-prefix-p vterm-buffer-name (buffer-name buffer))))))
                 (display-buffer-reuse-window display-buffer-at-bottom)
                 (reusable-frames . visible)
                 (window-height . 0.3))))
#+end_src
** Treesitter
#+begin_src emacs-lisp
(use-package tree-sitter
  :custom-face
  (tree-sitter-hl-face:property ((t (:slant normal))))
  :init
  (global-tree-sitter-mode)
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

(use-package tree-sitter-langs
  :ensure t)
#+end_src

** Russian keyboard layout
#+begin_src emacs-lisp
(use-package reverse-im
  :custom (reverse-im-input-methods '("russian-computer"))
  :config (reverse-im-mode t))
#+end_src

** Save place
#+begin_src emacs-lisp
(use-package saveplace
  :init (save-place-mode))

(use-package saveplace-pdf-view
  :after saveplace)
#+end_src
** Dired
#+begin_src emacs-lisp
(nmap
  :keymaps 'override
  :prefix "SPC o"
  "d" 'dired
  "D" (lambda ()
        (interactive)
        (dired default-directory)))
#+end_src
* Projects
** Projectile
#+begin_src emacs-lisp
(use-package projectile
  :init
  (projectile-mode +1))
#+end_src
* Languages
** Org-mode
#+begin_src emacs-lisp
(add-hook 'org-mode-hook
          (lambda ()
            (org-indent-mode +1)
            (setq org-edit-src-content-indentation 0)))
#+end_src

** Python
*** LSP
#+begin_src emacs-lisp
(add-hook 'python-mode-hook 'eglot-ensure)
(add-to-list 'eglot-server-programs
             '(python-mode . ("pyright-langserver" "--stdio")))
#+end_src
** Latex
*** Auctex
#+begin_src emacs-lisp
(use-package tex
  :straight auctex
  :custom
  (LaTeX-item-indent 0)
  (LaTeX-indent-level 4))
#+end_src
*** LSP
#+begin_src emacs-lisp
(add-hook 'LaTeX-mode-hook 'eglot-ensure)
(add-to-list 'eglot-server-programs
             '(latex-mode . ("texlab")))
#+end_src
*** Pretty symbols
#+begin_src emacs-lisp
(add-hook 'TeX-update-style-hook 'prettify-symbols-mode)
#+end_src
*** Outline
#+begin_src emacs-lisp
(add-hook 'LaTeX-mode-hook 'outline-minor-mode)
#+end_src
** C++
*** LSP
#+begin_src emacs-lisp
(add-hook 'c++-mode-hook 'eglot-ensure)
#+end_src
* Fix bugs
#+begin_src emacs-lisp
(when (eq system-type 'darwin)
  (customize-set-variable 'native-comp-driver-options '("-Wl,-w")))
#+end_src




